# Глава 3 Упорядочение данных

# Введение

In [1]:
import pandas as pd

In [2]:
url = 'https://tinyurl.com/titanic-csv'

In [3]:
dataframe = pd.read_csv(url)
dataframe.head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.00,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0

# Создание фрейма данных

In [4]:
import pandas as pd
dataframe = pd.DataFrame()
#Добавить столбцы
dataframe['Имя'] = ['Джеки Джексон', 'Стивен Стивенсон']
dataframe['Возраст'] = [38, 25]
dataframe['Водитель'] = ['True', 'False']

In [5]:
dataframe

                Имя  Возраст Водитель
0     Джеки Джексон       38     True
1  Стивен Стивенсон       25    False

In [6]:
#Создать строку
new_person = pd.Series(['Моли Муни', 40, True], index=['Имя', 'Возраст', 'Водитель'])

In [8]:
#Добавить строку в конец фрейма данных
dataframe.append(new_person, ignore_index=True)

                Имя  Возраст Водитель
0     Джеки Джексон       38     True
1  Стивен Стивенсон       25    False
2         Моли Муни       40     True

# Описание данных

In [ ]:
#Требуется взглянуть на некоторые характеристики фрейма данных

In [11]:
import pandas as pd
url = 'https://tinyurl.com/titanic-csv'
dataframe = pd.read_csv(url)
dataframe.head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [12]:
dataframe.shape

(1313, 6)

In [13]:
dataframe.describe()

              Age     Survived      SexCode
count  756.000000  1313.000000  1313.000000
mean    30.397989     0.342727     0.351866
std     14.259049     0.474802     0.477734
min      0.170000     0.000000     0.000000
25%     21.000000     0.000000     0.000000
50%     28.000000     0.000000     0.000000
75%     39.000000     1.000000     1.000000
max     71.000000     1.000000     1.000000

In [15]:
dataframe.tail(5)

                        Name PClass   Age   Sex  Survived  SexCode
1308      Zakarian, Mr Artun    3rd  27.0  male         0        0
1309  Zakarian, Mr Maprieder    3rd  26.0  male         0        0
1310        Zenni, Mr Philip    3rd  22.0  male         0        0
1311        Lievens, Mr Rene    3rd  24.0  male         0        0
1312          Zimmerman, Leo    3rd  29.0  male         0        0

# Навигация по фреймам данных

In [ ]:
#выбрать индивидуальные данные или срезы фрейма данных

In [1]:
import pandas as pd
url = 'https://tinyurl.com/titanic-csv'
dataframe = pd.read_csv(url)

In [2]:
#выбрать первую строчку
dataframe.iloc[0]

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                   29
Sex                               female
Survived                               1
SexCode                                1
Name: 0, dtype: object

In [3]:
#выбрать три строчки
dataframe.iloc[1:4]

,Name,PClass,Age,Sex,Survived,SexCode
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

In [4]:
#выбрать  четыре строчки
dataframe.iloc[:4]

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1

In [6]:
dataframe = dataframe.set_index(dataframe['Name'])
dataframe.loc['Allen, Miss Elisabeth Walton']

Name        Allen, Miss Elisabeth Walton
PClass                               1st
Age                                   29
Sex                               female
Survived                               1
SexCode                                1
Name: Allen, Miss Elisabeth Walton, dtype: object

# Выбор строк на основе условных конструкций

In [ ]:
#требуетс отобрать строки фрейма данных на основе некого условия

In [7]:
import pandas as pd
url = 'https://tinyurl.com/titanic-csv'
dataframe = pd.read_csv(url)
dataframe[dataframe['Sex'] == 'female'].head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [11]:
import pandas as pd
url = 'https://tinyurl.com/titanic-csv'
dataframe = pd.read_csv(url)
dataframe = dataframe[(dataframe['Sex'] == 'female') & (dataframe['Age'] >= 30)]
dataframe.head(3)

,Name,PClass,Age,Sex,Survived,SexCode
6,"Andrews, Miss Kornelia Theodosia",1st,63.0,female,1,1
8,"Appleton, Mrs Edward Dale (Charlotte Lamson)",1st,58.0,female,1,1
15,"Baxter, Mrs James (Helene DeLaudeniere Chaput)",1st,50.0,female,1,1

# Замена значений

In [19]:
import pandas as pd
url = 'https://tinyurl.com/titanic-csv'
dataframe = pd.read_csv(url)
dataframe['Sex'] = dataframe['Sex'].replace('female', 'Woman')
print(dataframe.head(5))

                                            Name PClass    Age    Sex  \
0                   Allen, Miss Elisabeth Walton    1st  29.00  Woman
1                    Allison, Miss Helen Loraine    1st   2.00  Woman
2            Allison, Mr Hudson Joshua Creighton    1st  30.00   male
3  Allison, Mrs Hudson JC (Bessie Waldo Daniels)    1st  25.00  Woman
4                  Allison, Master Hudson Trevor    1st   0.92   male

   Survived  SexCode
0         1        1
1         0        1
2         0        0
3         0        1
4         1        0

In [20]:
import pandas as pd
url = 'https://tinyurl.com/titanic-csv'
dataframe = pd.read_csv(url)
dataframe.replace(1, "One").head(2)

                           Name PClass Age     Sex Survived SexCode
0  Allen, Miss Elisabeth Walton    1st  29  female      One     One
1   Allison, Miss Helen Loraine    1st   2  female        0     One

In [21]:
dataframe.replace(r"1st", "First", regex=True).head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton  First  29.0  female         1        1
1   Allison, Miss Helen Loraine  First   2.0  female         0        1

# Переименование столбцов

In [ ]:
#требуется переименовать столбец во фрейме данных pandas

In [1]:
import pandas as pd
url = 'https://tinyurl.com/titanic-csv'
dataframe = pd.read_csv(url)
dataframe.rename(columns={'PClass': 'Passenger Class'}).head(2)

,Name,Passenger Class,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1

In [2]:
dataframe.rename(columns={'PClass': 'Passenger Class', 'Sex':'Gender'}).head(2)

,Name,Passenger Class,Age,Gender,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1

In [3]:
import collections
column_names = collections.defaultdict(str)

In [5]:
for name in dataframe.columns:
    column_names[name]

In [6]:
column_names

defaultdict(str,
            {'Name': '',
             'PClass': '',
             'Age': '',
             'Sex': '',
             'Survived': '',
             'SexCode': ''})

# Нахождение минимума, максимума, суммы, среднего арифмитического и количества

In [ ]:
#найти минимум , максимум, сумму, 
#среднее арифмитическое и количество значений числового столбца

In [8]:
import pandas as pd
url = 'https://tinyurl.com/titanic-csv'
dataframe = pd.read_csv(url)
dataframe.head(3)

                                  Name PClass   Age     Sex  Survived  SexCode
0         Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1          Allison, Miss Helen Loraine    1st   2.0  female         0        1
2  Allison, Mr Hudson Joshua Creighton    1st  30.0    male         0        0

In [19]:
print('максимум: ', dataframe['Age'].max())

максимум:  71.0

In [20]:
print('минимум: ', dataframe['Age'].min())

минимум:  0.17

In [21]:
print('среднее: ', dataframe['Age'].mean())

среднее:  30.397989417989415

In [22]:
print('сумма всех значений: ', dataframe['Age'].sum())

сумма всех значений:  22980.88

In [23]:
print('количество значений столбцов: ', dataframe['Age'].count())

количество значений столбцов:  756

In [24]:
#дисперсия
print('дисперсия: ', dataframe['Age'].var())

дисперсия:  203.32047012439133

In [25]:
#стандартное отклонение
print('стандартное отклонение: ', dataframe['Age'].std())

стандартное отклонение:  14.259048710359023

In [26]:
(dataframe['Age'].std())**2

203.3204701243913

In [27]:
#коэффициент экцесса
#Коэффицие́нт эксце́сса (коэффициент островершинности) 
#в теории вероятностей — мера остроты пика распределения случайной величины.
print('коэффициент экцесса: ', dataframe['Age'].kurt())

коэффициент экцесса:  -0.036536168924722556

In [28]:
#коэффициент ассиметрии величина, характеризующая асимметрию распределения данной случайной величины. 
print('коэффициент ассиметрии: ', dataframe['Age'].skew())

коэффициент ассиметрии:  0.36851087371648295

In [30]:
#стандартная ошибка среднего
#Стандартная ошибка среднего в математической статистике — величина, 
#характеризующая стандартное отклонение выборочного среднего, 
#рассчитанное по выборке размера n из генеральной совокупности. 
print('стандартная ошибка среднего: ', dataframe['Age'].sem())

стандартная ошибка среднего:  0.5185965877244657

In [31]:
#мода
#Мо́да — значение во множестве наблюдений, которое встречается наиболее часто.
print('мода: ', dataframe['Age'].sem())

мода:  0.5185965877244657

In [34]:
#Медиа́на (от лат. mediāna — середина) в математической статистике — 
#число, характеризующее выборку (например, набор чисел). 
#Если все элементы выборки различны, то медиана — это такое 
#число выборки, что ровно половина 
#из элементов выборки больше него, а другая половина меньше него.
print('медиана: ', dataframe['Age'].median())

медиана:  28.0

In [35]:
#Методы можно применять ко всему фрейму данных
dataframe.count()

Name        1313
PClass      1313
Age          756
Sex         1313
Survived    1313
SexCode     1313
dtype: int64

# Нахождение уникальных значений

In [36]:
import pandas as pd
url = 'https://tinyurl.com/titanic-csv'
dataframe = pd.read_csv(url)

In [37]:
dataframe['Sex'].unique()

array(['female', 'male'], dtype=object)

In [38]:
dataframe['Sex'].value_counts()

male      851
female    462
Name: Sex, dtype: int64

In [42]:
#показать все уникальные значения
dataframe['PClass'].value_counts()

3rd    711
1st    322
2nd    279
*        1
Name: PClass, dtype: int64

In [43]:
#подсчет количества уникальных значений
dataframe['PClass'].nunique()

4

# Отбор пропущенных значений

In [44]:
import pandas as pd
url = 'https://tinyurl.com/titanic-csv'
dataframe = pd.read_csv(url)

In [45]:
dataframe[dataframe['Age'].isnull()].head(2)

                            Name PClass  Age     Sex  Survived  SexCode
12  Aubert, Mrs Leontine Pauline    1st  NaN  female         1        1
13      Barkworth, Mr Algernon H    1st  NaN    male         1        0

In [46]:
dataframe[dataframe['Age'].notnull()].head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [47]:
dataframe['Sex'] = dataframe['Sex'].replace('male', NaN)

NameError: name 'NaN' is not defined

In [56]:
#заменить значения с NaN
import pandas as pd
import numpy as np
url = 'https://tinyurl.com/titanic-csv'
dataframe = pd.read_csv(url)
dataframe['Sex'] = dataframe['Sex'].replace('male', np.nan)
dataframe[dataframe['Sex'].isnull()].head(5)

                                  Name PClass    Age  Sex  Survived  SexCode
2  Allison, Mr Hudson Joshua Creighton    1st  30.00  NaN         0        0
4        Allison, Master Hudson Trevor    1st   0.92  NaN         1        0
5                   Anderson, Mr Harry    1st  47.00  NaN         1        0
7               Andrews, Mr Thomas, jr    1st  39.00  NaN         0        0
9               Artagaveytia, Mr Ramon    1st  71.00  NaN         0        0

In [60]:
import pandas as pd
import numpy as np
url = 'https://tinyurl.com/titanic-csv'
dataframe = pd.read_csv(url, na_values=[np.nan, 'NONE', -999])
dataframe[dataframe['Age'].isnull()].head(5)

                            Name PClass  Age     Sex  Survived  SexCode
12  Aubert, Mrs Leontine Pauline    1st  NaN  female         1        1
13      Barkworth, Mr Algernon H    1st  NaN    male         1        0
14            Baumann, Mr John D    1st  NaN    male         0        0
29       Borebank, Mr John James    1st  NaN    male         0        0
32            Bradley, Mr George    1st  NaN    male         1        0

# Удаление столбца

In [1]:
import pandas as pd
url = 'https://tinyurl.com/titanic-csv'
dataframe = pd.read_csv(url)

In [2]:
dataframe.drop('Age', axis=1).head(2)

                           Name PClass     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  female         1        1
1   Allison, Miss Helen Loraine    1st  female         0        1

In [3]:
#удаление двух столбцов
dataframe.drop(['Age', 'Sex'], axis=1).head(2)

                           Name PClass  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st         1        1
1   Allison, Miss Helen Loraine    1st         0        1

In [9]:
#если столбец не имеет имени его можно отбросить по индексу столбца с 
#помощью массива dataframe.columns
dataframe.drop(dataframe.columns[1], axis=1).head(2)

                           Name   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton  29.0  female         1        1
1   Allison, Miss Helen Loraine   2.0  female         0        1

In [11]:
#фреймы данных как немутирующие объекты
#создать новый фрейм данных
dataframe_name_dropped = dataframe.drop(dataframe.columns[0], axis=1)
dataframe_name_dropped.head(2)

  PClass   Age     Sex  Survived  SexCode
0    1st  29.0  female         1        1
1    1st   2.0  female         0        1

# Удаление строки

In [12]:
import pandas as pd
url = 'https://tinyurl.com/titanic-csv'
dataframe = pd.read_csv(url)

In [13]:
dataframe[dataframe['Sex'] != 'male'].head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [15]:
dataframe.drop([0, 4]).head(8)

,Name,PClass,Age,Sex,Survived,SexCode
1,"Allison, Miss Helen Loraine",1st,2.0,female,0,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.0,female,0,1
5,"Anderson, Mr Harry",1st,47.0,male,1,0
6,"Andrews, Miss Kornelia Theodosia",1st,63.0,female,1,1
7,"Andrews, Mr Thomas, jr",1st,39.0,male,0,0
8,"Appleton, Mrs Edward Dale (Charlotte Lamson)",1st,58.0,female,1,1
9,"Artagaveytia, Mr Ramon",1st,71.0,male,0,0

In [16]:
dataframe[dataframe['Name'] != 'Allison, Mr Hudson Joshua Creighton'].head(2)

                           Name PClass   Age     Sex  Survived  SexCode
0  Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
1   Allison, Miss Helen Loraine    1st   2.0  female         0        1

In [18]:
dataframe[dataframe.index != 1].head(5)

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.00,female,1,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.00,male,0,0
3,"Allison, Mrs Hudson JC (Bessie Waldo Daniels)",1st,25.00,female,0,1
4,"Allison, Master Hudson Trevor",1st,0.92,male,1,0
5,"Anderson, Mr Harry",1st,47.00,male,1,0

# Удаление повторяющихся строк

In [26]:
import pandas as pd
url = 'https://tinyurl.com/titanic-csv'
dataframe = pd.read_csv(url)

dataframe.shape

(1313, 6)

In [28]:
dataframe.drop_duplicates(subset='PClass').shape

(4, 6)

In [31]:
#удалили повторяющиеся классы
dataframe.drop_duplicates(subset='PClass').head(4)

                             Name PClass   Age     Sex  Survived  SexCode
0    Allen, Miss Elisabeth Walton    1st  29.0  female         1        1
322            Abelson, Mr Samuel    2nd  30.0    male         0        0
456           Jacobsohn Mr Samuel      *   NaN    male         0        0
602            Abbing, Mr Anthony    3rd  42.0    male         0        0

In [32]:
len(dataframe)

1313

In [33]:
len(dataframe.drop_duplicates(subset='PClass'))

4

In [34]:
dataframe.drop_duplicates(subset='Sex', keep='last')

                     Name PClass   Age     Sex  Survived  SexCode
1307  Zabour, Miss Tamini    3rd   NaN  female         0        1
1312       Zimmerman, Leo    3rd  29.0    male         0        0

In [37]:
dataframe.duplicated(subset='PClass').head(10)

0    False
1     True
2     True
3     True
4     True
5     True
6     True
7     True
8     True
9     True
dtype: bool

In [38]:
dataframe.duplicated(subset='Sex').head(10)

0    False
1     True
2    False
3     True
4     True
5     True
6     True
7     True
8     True
9     True
dtype: bool

In [39]:
dataframe.drop_duplicates(subset=['PClass', 'Sex'])

,Name,PClass,Age,Sex,Survived,SexCode
0,"Allen, Miss Elisabeth Walton",1st,29.0,female,1,1
2,"Allison, Mr Hudson Joshua Creighton",1st,30.0,male,0,0
322,"Abelson, Mr Samuel",2nd,30.0,male,0,0
323,"Abelson, Mrs Samuel (Anna)",2nd,28.0,female,1,1
456,Jacobsohn Mr Samuel,*,NaN,male,0,0
602,"Abbing, Mr Anthony",3rd,42.0,male,0,0
605,"Abbott, Mrs Stanton (Rosa)",3rd,35.0,female,1,1

In [40]:
dataframe.drop_duplicates(subset=['PClass', 'Sex']).shape

(7, 6)

In [41]:
dataframe.drop_duplicates(subset=['PClass', 'Sex', 'Age']).shape

(281, 6)

# Группировка строк по значениям

In [42]:
#требуется сгруппировать отдельные 
#строки в соответствии с некоторым общим значением
import pandas as pd
url = 'https://tinyurl.com/titanic-csv'
dataframe = pd.read_csv(url)

In [43]:
dataframe.groupby('Sex').mean()

              Age  Survived  SexCode
Sex
female  29.396424  0.666667      1.0
male    31.014338  0.166863      0.0

In [44]:
dataframe.groupby('Sex')

In [48]:
dataframe.groupby('Survived').count()

          Name  PClass  Age  Sex  SexCode
Survived
0          863     863  443  863      863
1          450     450  313  450      450

In [49]:
dataframe.groupby('Survived')['Name'].count()

Survived
0    863
1    450
Name: Name, dtype: int64

In [50]:
dataframe.groupby(['Sex', 'Survived'])['Age'].mean()

Sex     Survived
female  0           24.901408
        1           30.867143
male    0           32.320780
        1           25.951875
Name: Age, dtype: float64

# Группирование строк по времени

In [61]:
import pandas as pd
import numpy as np

In [62]:
#создать диапазон дат
time_index = pd.date_range('06/06/2017', periods=100000, freq='30S')
#создать фрейм данных
dataframe = pd.DataFrame(index=time_index)

In [63]:
dataframe.head(3)

Empty DataFrame
Columns: []
Index: [2017-06-06 00:00:00, 2017-06-06 00:00:30, 2017-06-06 00:01:00]

In [64]:
dataframe.tail(3)

Empty DataFrame
Columns: []
Index: [2017-07-10 17:18:30, 2017-07-10 17:19:00, 2017-07-10 17:19:30]

In [65]:
#создать столбец случайных значений
dataframe['Sale_Amount'] = np.random.randint(1, 10, 100000)
#сгруппировать строки по неделе, вычислить сумму за  неделю
dataframe.resample('W').sum()
#метод resample требует чтобы индекс имел значения с типом данных datetime

            Sale_Amount
2017-06-11        86360
2017-06-18       100589
2017-06-25       100068
2017-07-02       101052
2017-07-09       101021
2017-07-16        10474

In [58]:
#сгруппировать по двум неделям и вычислить среднее
dataframe.resample('2W').mean()

            Sale_Amount
2017-06-11     5.004340
2017-06-25     4.971156
2017-07-09     5.014633
2017-07-23     5.020673

In [59]:
#Сгруппировать по месяцу и подсчитать строки
dataframe.resample('M').count()

            Sale_Amount
2017-06-30        72000
2017-07-31        28000

In [60]:
dataframe.resample('M', label='left').count()

            Sale_Amount
2017-05-31        72000
2017-06-30        28000

# Обход столбца в цикле

In [ ]:
#требуется выполнить итерацию по каждому элементу 
#в столбце и применить какое-то действие

In [1]:
import pandas as pd
url = 'https://tinyurl.com/titanic-csv'
dataframe = pd.read_csv(url)

In [3]:
dataframe['Name'][0:2]

0    Allen, Miss Elisabeth Walton
1     Allison, Miss Helen Loraine
Name: Name, dtype: object

In [2]:
#Напечатать первые два имени в верхнем регистре
for name in dataframe['Name'][0:2]:
    print(name.upper())

ALLEN, MISS ELISABETH WALTON
ALLISON, MISS HELEN LORAINE

In [4]:
[name.upper() for name in dataframe['Name'][0:2]]

['ALLEN, MISS ELISABETH WALTON', 'ALLISON, MISS HELEN LORAINE']

# Применение функции ко всем элементам в столбце

In [5]:
import pandas as pd
url = 'https://tinyurl.com/titanic-csv'
dataframe = pd.read_csv(url)

In [7]:
#Создать функцию
def uppercase(x):
    return x.upper()

In [8]:
#Применить функцию, показать две строки
dataframe['Name'].apply(uppercase)[0:2]

0    ALLEN, MISS ELISABETH WALTON
1     ALLISON, MISS HELEN LORAINE
Name: Name, dtype: object

# Применение функции к группам

In [ ]:
#строки сгуппировали с помощью метода groupby и теперь требуется применить 
#функцию к каждой группе

In [9]:
import pandas as pd
url = 'https://tinyurl.com/titanic-csv'
dataframe = pd.read_csv(url)

In [11]:
dataframe.groupby('Sex').apply(lambda x: x.count())

        Name  PClass  Age  Sex  Survived  SexCode
Sex
female   462     462  288  462       462      462
male     851     851  468  851       851      851

# Конкатенация фреймов данных

In [ ]:
#требуется связать последовательно два фрейма данных

In [12]:
import pandas as pd

In [13]:
data_a = {
    'id': ['1', '2', '3'],
    'first': ['Alex', 'Amy', 'Allen'],
    'last': ['Anderson', 'Ackerman', 'Ali']
}

In [14]:
dataframe_a = pd.DataFrame(data_a, columns = ['id', 'first', 'last'])
dataframe_a.head(3)

  id  first      last
0  1   Alex  Anderson
1  2    Amy  Ackerman
2  3  Allen       Ali

In [15]:
data_b = {
    'id': ['4', '5', '6'],
    'first': ['Billy', 'Brian', 'Bran'],
    'last': ['Bonder', 'Black', 'Balwner']
}
dataframe_b = pd.DataFrame(data_b, columns = ['id', 'first', 'last'])
dataframe_b.head(3)

  id  first     last
0  4  Billy   Bonder
1  5  Brian    Black
2  6   Bran  Balwner

In [16]:
#Конкатенировать фреймы данных по строкам
pd.concat([dataframe_a, dataframe_b], axis=0)

  id  first      last
0  1   Alex  Anderson
1  2    Amy  Ackerman
2  3  Allen       Ali
0  4  Billy    Bonder
1  5  Brian     Black
2  6   Bran   Balwner

In [17]:
#Конкатенировать фреймы данных по столбцам
pd.concat([dataframe_a, dataframe_b], axis=1)

  id  first      last id  first     last
0  1   Alex  Anderson  4  Billy   Bonder
1  2    Amy  Ackerman  5  Brian    Black
2  3  Allen       Ali  6   Bran  Balwner

In [23]:
row = pd.Series([10, 'Chris', 'Chillon'], index=['id', 'first', 'last'])
dataframe_a.append(row, ignore_index=True)

   id  first      last
0   1   Alex  Anderson
1   2    Amy  Ackerman
2   3  Allen       Ali
3  10  Chris   Chillon

# Слияние фреймов данных

In [26]:
import pandas as pd
employee_data = {
    'employee_id': ['1', '2', '3', '4'],
    'name': ['Amy Jones', 'Allen Keys', 'Alice Bees', 'Tom Horton']
}
dataframe_employees = pd.DataFrame(employee_data, columns = ['employee_id', 'name'])
dataframe_employees.head(4)

  employee_id        name
0           1   Amy Jones
1           2  Allen Keys
2           3  Alice Bees
3           4  Tom Horton

In [28]:
sales_data = {
    'employee_id': ['3', '4', '5', '6'],
    'total_sales': [23456, 2512, 2345, 1455]
}
dataframe_sales = pd.DataFrame(sales_data, columns= ['employee_id', 'total_sales'])
dataframe_sales.head(4)

  employee_id  total_sales
0           3        23456
1           4         2512
2           5         2345
3           6         1455

In [29]:
#слияние фреймов
pd.merge(dataframe_employees, dataframe_sales, on='employee_id')

  employee_id        name  total_sales
0           3  Alice Bees        23456
1           4  Tom Horton         2512

In [30]:
#внешнее соединение(каждое с каждым)
pd.merge(dataframe_employees, dataframe_sales, on='employee_id', how='outer')

  employee_id        name  total_sales
0           1   Amy Jones          NaN
1           2  Allen Keys          NaN
2           3  Alice Bees      23456.0
3           4  Tom Horton       2512.0
4           5         NaN       2345.0
5           6         NaN       1455.0

In [31]:
pd.merge(dataframe_employees, dataframe_sales, on='employee_id', how='left')

  employee_id        name  total_sales
0           1   Amy Jones          NaN
1           2  Allen Keys          NaN
2           3  Alice Bees      23456.0
3           4  Tom Horton       2512.0

In [33]:
pd.merge(dataframe_employees, dataframe_sales, on='employee_id', how='right')

  employee_id        name  total_sales
0           3  Alice Bees        23456
1           4  Tom Horton         2512
2           5         NaN         2345
3           6         NaN         1455

In [34]:
pd.merge(dataframe_employees, dataframe_sales, left_on='employee_id', right_on='employee_id')

  employee_id        name  total_sales
0           3  Alice Bees        23456
1           4  Tom Horton         2512

In [39]:
#слияние по индексам
pd.merge(dataframe_employees, dataframe_sales, right_index=True, left_index=True)

  employee_id_x        name employee_id_y  total_sales
0             1   Amy Jones             3        23456
1             2  Allen Keys             4         2512
2             3  Alice Bees             5         2345
3             4  Tom Horton             6         1455